# Freds Dotfiles 2025
# the full BSD 2-Clause License can be found in the LICENSE file
#
# Brewfile for setting up my MacOS system
#
# run: brew bundle install
# -> this will install everything listed in this file

### Casks
## Desktop software
# Coding
cask "emacs-app"

# Internet related
cask "firefox"
cask "freetube"
cask "netnewswire"
#cask "discord"

# Utilities
cask "iterm2"
cask "freelens"
cask "android-file-transfer"
cask "the-unarchiver"
cask "turbovnc-viewer"

# Music
cask "deadbeef@nightly"

# Office
cask "openoffice"

# Graphics programs
cask "gimp"
#cask "freecad"
#cask "krita"

# Math software
#cask "lyx"

### Brews
## Terminal user interfaces applications
brew "tmux"
brew "midnight-commander"
brew "dialog"
brew "ncdu"
brew "superfile"

## Command line programs
# bash utlities
brew "bash"
brew "bash-completion"
brew "shellspec"
brew "btop"
brew "watch"
brew "fzf"
brew "pstree"
brew "pwgen"
brew "stow"
brew "tree"

# Security
brew "clamav"
brew "gpg-tui"
#brew "ssh-audit"

# Video
brew "ffmpeg"

# Graphics
brew "figlet"
brew "graphviz"
#brew "tesseract"

# Texteditors
#brew "neovim"

# Coding
brew "git"
brew "glow"
brew "jq"
brew "yq"
#brew "tree-sitter"

# Python
brew "uv"
brew "python-lsp-server"
brew "numpy"
brew "ipython"
brew "poetry"
brew "pytest"

# Ansible
brew "ansible"
brew "ansible-lint"

# Kubernetes related
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kind"
brew "krew"
#brew "minikube"

# Internet / Network
brew "wget"
brew "irssi"
brew "links"
brew "mtr"
brew "nmap"
brew "yt-dlp"
brew "telnet"

# Typesetting
brew "markdown"

# Work related
#brew "qemu"
#brew "rhino"

# Database tools
brew "sqlite"
